In [1]:
import pandas as pd

In [9]:
# Lista
data = [['Juan',25],["Martha",19],["Pedro",20]]

In [7]:
df = pd.DataFrame(data,columns=["nombre","edad"])

In [8]:
df

   nombre  edad
0    Juan    25
1  Martha    19
2   Pedro    20

In [13]:
# Diccionario

data = {'Nombre':["Juan","Martha","Pedro"],
      'Edad':[20,30,40]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

   Nombre  Edad
0    Juan    20
1  Martha    30
2   Pedro    40

In [16]:
data = (('Juan',25),("Martha",19),("Pedro",20))

In [20]:
df = pd.DataFrame(data,columns=["nombre","edad"])

In [21]:
df

   nombre  edad
0    Juan    25
1  Martha    19
2   Pedro    20

In [25]:
df = pd.read_csv("../data/data",sep='|')

In [27]:
df = pd.read_csv("../data/data.csv")

In [28]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla